espressif/esp-idf/components/soc/esp32h4/register/soc/spi_mem_c_struct.h
/** Type of smem_ac register
 *  MSPI external RAM ECC and SPI CS timing control register
 */
typedef union {
    struct {
        /** smem_cs_setup : R/W; bitpos: [0]; default: 0;
         *  For SPI0 and SPI1, spi cs is enable when spi is in prepare phase. 1: enable 0:
         *  disable.
         */
        uint32_t smem_cs_setup:1;
        /** smem_cs_hold : R/W; bitpos: [1]; default: 0;
         *  For SPI0 and SPI1, spi cs keep low when spi is in done phase. 1: enable 0: disable.
         */
        uint32_t smem_cs_hold:1;
        /** smem_cs_setup_time : R/W; bitpos: [6:2]; default: 1;
         *  For spi0, (cycles-1) of prepare phase by spi clock this bits are combined with
         *  spi_mem_c_cs_setup bit.
         */
        uint32_t smem_cs_setup_time:5;
        /** smem_cs_hold_time : R/W; bitpos: [11:7]; default: 1;
         *  For SPI0 and SPI1, spi cs signal is delayed to inactive by spi clock this bits are
         *  combined with spi_mem_c_cs_hold bit.
         */
        uint32_t smem_cs_hold_time:5;
        /** smem_ecc_cs_hold_time : R/W; bitpos: [14:12]; default: 3;
         *  SPI_SMEM_CS_HOLD_TIME + SPI_SMEM_ECC_CS_HOLD_TIME is the SPI0 and SPI1 CS hold
         *  cycles in ECC mode when accessed external RAM.
         */
        uint32_t smem_ecc_cs_hold_time:3;
        /** smem_ecc_skip_page_corner : R/W; bitpos: [15]; default: 1;
         *  1: SPI0 skips page corner when accesses external RAM. 0: Not skip page corner when
         *  accesses external RAM.
         */
        uint32_t smem_ecc_skip_page_corner:1;
        /** smem_ecc_16to18_byte_en : R/W; bitpos: [16]; default: 0;
         *  Set this bit to enable SPI0 and SPI1 ECC 16 bytes data with 2 ECC bytes mode when
         *  accesses external RAM.
         */
        uint32_t smem_ecc_16to18_byte_en:1;
        uint32_t reserved_17:8;
        /** smem_cs_hold_delay : R/W; bitpos: [30:25]; default: 0;
         *  These bits are used to set the minimum CS high time tSHSL between SPI burst
         *  transfer when accesses to external RAM. tSHSL is (SPI_SMEM_CS_HOLD_DELAY[5:0] + 1)
         *  MSPI core clock cycles.
         */
        uint32_t smem_cs_hold_delay:6;
        /** smem_split_trans_en : R/W; bitpos: [31]; default: 0;
         *  Set this bit to enable SPI0 split one AXI accesses EXT_RAM transfer into two SPI
         *  transfers when one transfer will cross flash/EXT_RAM page corner, valid no matter
         *  whether there is an ECC region or not.
         */
        uint32_t smem_split_trans_en:1;
    };
    uint32_t val;
} spi_smem_ac_reg_t;


/** Group: State control register */
/** Type of fsm register
 *  SPI0 FSM status register
 */
typedef union {
    struct {
        uint32_t reserved_0:7;
        /** lock_delay_time : R/W; bitpos: [18:7]; default: 4;
         *  The lock delay time of SPI0/1 arbiter by spi0_slv_st, after PER is sent by SPI1.
         */
        uint32_t lock_delay_time:12;
        /** flash_lock_en : R/W; bitpos: [19]; default: 0;
         *  The lock enable for FLASH to lock spi0 trans req.1: Enable. 0: Disable.
         */
        uint32_t flash_lock_en:1;
        /** sram_lock_en : R/W; bitpos: [20]; default: 0;
         *  The lock enable for external RAM to lock spi0 trans req.1: Enable. 0: Disable.
         */
        uint32_t sram_lock_en:1;
        uint32_t reserved_21:11;
    };
    uint32_t val;
} spi_mem_c_fsm_reg_t;


/** Group: Interrupt registers */
/** Type of int_ena register
 *  SPI0 interrupt enable register
 */
typedef union {
    struct {
        uint32_t reserved_0:3;
        /** slv_st_end_int_ena : R/W; bitpos: [3]; default: 0;
         *  The enable bit for SPI_MEM_SLV_ST_END_INT interrupt.
         */
        uint32_t slv_st_end_int_ena:1;
        /** mst_st_end_int_ena : R/W; bitpos: [4]; default: 0;
         *  The enable bit for SPI_MEM_MST_ST_END_INT interrupt.
         */
        uint32_t mst_st_end_int_ena:1;
        /** ecc_err_int_ena : R/W; bitpos: [5]; default: 0;
         *  The enable bit for SPI_MEM_ECC_ERR_INT interrupt.
         */
        uint32_t ecc_err_int_ena:1;
        /** pms_reject_int_ena : R/W; bitpos: [6]; default: 0;
         *  The enable bit for SPI_MEM_PMS_REJECT_INT interrupt.
         */
        uint32_t pms_reject_int_ena:1;
        /** axi_raddr_err_int_ena : R/W; bitpos: [7]; default: 0;
         *  The enable bit for SPI_MEM_AXI_RADDR_ERR_INT interrupt.
         */
        uint32_t axi_raddr_err_int_ena:1;
        /** axi_wr_flash_err_int_ena : R/W; bitpos: [8]; default: 0;
         *  The enable bit for SPI_MEM_AXI_WR_FALSH_ERR_INT interrupt.
         */
        uint32_t axi_wr_flash_err_int_ena:1;
        /** axi_waddr_err_int__ena : R/W; bitpos: [9]; default: 0;
         *  The enable bit for SPI_MEM_AXI_WADDR_ERR_INT interrupt.
         */
        uint32_t axi_waddr_err_int__ena:1;
        uint32_t reserved_10:18;
        /** dqs0_afifo_ovf_int_ena : R/W; bitpos: [28]; default: 0;
         *  The enable bit for SPI_MEM_DQS0_AFIFO_OVF_INT interrupt.
         */
        uint32_t dqs0_afifo_ovf_int_ena:1;
        /** dqs1_afifo_ovf_int_ena : R/W; bitpos: [29]; default: 0;
         *  The enable bit for SPI_MEM_DQS1_AFIFO_OVF_INT interrupt.
         */
        uint32_t dqs1_afifo_ovf_int_ena:1;
        /** bus_fifo1_udf_int_ena : R/W; bitpos: [30]; default: 0;
         *  The enable bit for SPI_MEM_BUS_FIFO1_UDF_INT interrupt.
         */
        uint32_t bus_fifo1_udf_int_ena:1;
        /** bus_fifo0_udf_int_ena : R/W; bitpos: [31]; default: 0;
         *  The enable bit for SPI_MEM_BUS_FIFO0_UDF_INT interrupt.
         */
        uint32_t bus_fifo0_udf_int_ena:1;
    };
    uint32_t val;
} spi_mem_c_int_ena_reg_t;

/** Type of int_clr register
 *  SPI0 interrupt clear register
 */
typedef union {
    struct {
        uint32_t reserved_0:3;
        /** slv_st_end_int_clr : WT; bitpos: [3]; default: 0;
         *  The clear bit for SPI_MEM_SLV_ST_END_INT interrupt.
         */
        uint32_t slv_st_end_int_clr:1;
        /** mst_st_end_int_clr : WT; bitpos: [4]; default: 0;
         *  The clear bit for SPI_MEM_MST_ST_END_INT interrupt.
         */
        uint32_t mst_st_end_int_clr:1;
        /** ecc_err_int_clr : WT; bitpos: [5]; default: 0;
         *  The clear bit for SPI_MEM_ECC_ERR_INT interrupt.
         */
        uint32_t ecc_err_int_clr:1;
        /** pms_reject_int_clr : WT; bitpos: [6]; default: 0;
         *  The clear bit for SPI_MEM_PMS_REJECT_INT interrupt.
         */
        uint32_t pms_reject_int_clr:1;
        /** axi_raddr_err_int_clr : WT; bitpos: [7]; default: 0;
         *  The clear bit for SPI_MEM_AXI_RADDR_ERR_INT interrupt.
         */
        uint32_t axi_raddr_err_int_clr:1;
        /** axi_wr_flash_err_int_clr : WT; bitpos: [8]; default: 0;
         *  The clear bit for SPI_MEM_AXI_WR_FALSH_ERR_INT interrupt.
         */
        uint32_t axi_wr_flash_err_int_clr:1;
        /** axi_waddr_err_int_clr : WT; bitpos: [9]; default: 0;
         *  The clear bit for SPI_MEM_AXI_WADDR_ERR_INT interrupt.
         */
        uint32_t axi_waddr_err_int_clr:1;
        uint32_t reserved_10:18;
        /** dqs0_afifo_ovf_int_clr : WT; bitpos: [28]; default: 0;
         *  The clear bit for SPI_MEM_DQS0_AFIFO_OVF_INT interrupt.
         */
        uint32_t dqs0_afifo_ovf_int_clr:1;
        /** dqs1_afifo_ovf_int_clr : WT; bitpos: [29]; default: 0;
         *  The clear bit for SPI_MEM_DQS1_AFIFO_OVF_INT interrupt.
         */
        uint32_t dqs1_afifo_ovf_int_clr:1;
        /** bus_fifo1_udf_int_clr : WT; bitpos: [30]; default: 0;
         *  The clear bit for SPI_MEM_BUS_FIFO1_UDF_INT interrupt.
         */
        uint32_t bus_fifo1_udf_int_clr:1;
        /** bus_fifo0_udf_int_clr : WT; bitpos: [31]; default: 0;
         *  The clear bit for SPI_MEM_BUS_FIFO0_UDF_INT interrupt.
         */
        uint32_t bus_fifo0_udf_int_clr:1;
    };
    uint32_t val;
} spi_mem_c_int_clr_reg_t;

/** Type of int_raw register
 *  SPI0 interrupt raw register
 */
typedef union {
    struct {
        uint32_t reserved_0:3;
        /** slv_st_end_int_raw : R/WTC/SS; bitpos: [3]; default: 0;
         *  The raw bit for SPI_MEM_SLV_ST_END_INT interrupt. 1: Triggered when spi0_slv_st is
         *  changed from non idle state to idle state. It means that SPI_CS raises high. 0:
         *  Others
         */
        uint32_t slv_st_end_int_raw:1;
        /** mst_st_end_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  The raw bit for SPI_MEM_MST_ST_END_INT interrupt. 1: Triggered when spi0_mst_st is
         *  changed from non idle state to idle state. 0: Others.
         */
        uint32_t mst_st_end_int_raw:1;
        /** ecc_err_int_raw : R/WTC/SS; bitpos: [5]; default: 0;
         *  The raw bit for SPI_MEM_ECC_ERR_INT interrupt. When SPI_FMEM_ECC_ERR_INT_EN is set
         *  and  SPI_SMEM_ECC_ERR_INT_EN is cleared, this bit is triggered when the error times
         *  of SPI0/1 ECC read flash are equal or bigger than SPI_MEM_ECC_ERR_INT_NUM. When
         *  SPI_FMEM_ECC_ERR_INT_EN is cleared and  SPI_SMEM_ECC_ERR_INT_EN is set, this bit is
         *  triggered when the error times of SPI0/1 ECC read external RAM are equal or bigger
         *  than SPI_MEM_ECC_ERR_INT_NUM. When SPI_FMEM_ECC_ERR_INT_EN and
         *  SPI_SMEM_ECC_ERR_INT_EN are set, this bit is triggered when the total error times
         *  of SPI0/1 ECC read external RAM and flash are equal or bigger than
         *  SPI_MEM_ECC_ERR_INT_NUM. When SPI_FMEM_ECC_ERR_INT_EN and  SPI_SMEM_ECC_ERR_INT_EN
         *  are cleared, this bit will not be triggered.
         */
        uint32_t ecc_err_int_raw:1;
        /** pms_reject_int_raw : R/WTC/SS; bitpos: [6]; default: 0;
         *  The raw bit for SPI_MEM_PMS_REJECT_INT interrupt. 1: Triggered when SPI1 access is
         *  rejected. 0: Others.
         */
        uint32_t pms_reject_int_raw:1;
        /** axi_raddr_err_int_raw : R/WTC/SS; bitpos: [7]; default: 0;
         *  The raw bit for SPI_MEM_AXI_RADDR_ERR_INT interrupt. 1: Triggered when AXI read
         *  address is invalid by compared to MMU configuration. 0: Others.
         */
        uint32_t axi_raddr_err_int_raw:1;
        /** axi_wr_flash_err_int_raw : R/WTC/SS; bitpos: [8]; default: 0;
         *  The raw bit for SPI_MEM_AXI_WR_FALSH_ERR_INT interrupt. 1: Triggered when AXI write
         *  flash request is received. 0: Others.
         */
        uint32_t axi_wr_flash_err_int_raw:1;
        /** axi_waddr_err_int_raw : R/WTC/SS; bitpos: [9]; default: 0;
         *  The raw bit for SPI_MEM_AXI_WADDR_ERR_INT interrupt. 1: Triggered when AXI write
         *  address is invalid by compared to MMU configuration. 0: Others.
         */
        uint32_t axi_waddr_err_int_raw:1;
        uint32_t reserved_10:18;
        /** dqs0_afifo_ovf_int_raw : R/WTC/SS; bitpos: [28]; default: 0;
         *  The raw bit for SPI_MEM_DQS0_AFIFO_OVF_INT interrupt. 1: Triggered when the AFIFO
         *  connected to SPI_DQS1 is overflow.
         */
        uint32_t dqs0_afifo_ovf_int_raw:1;
        /** dqs1_afifo_ovf_int_raw : R/WTC/SS; bitpos: [29]; default: 0;
         *  The raw bit for SPI_MEM_DQS1_AFIFO_OVF_INT interrupt. 1: Triggered when the AFIFO
         *  connected to SPI_DQS is overflow.
         */
        uint32_t dqs1_afifo_ovf_int_raw:1;
        /** bus_fifo1_udf_int_raw : R/WTC/SS; bitpos: [30]; default: 0;
         *  The raw bit for SPI_MEM_BUS_FIFO1_UDF_INT interrupt. 1: Triggered when BUS1 FIFO is
         *  underflow.
         */
        uint32_t bus_fifo1_udf_int_raw:1;
        /** bus_fifo0_udf_int_raw : R/WTC/SS; bitpos: [31]; default: 0;
         *  The raw bit for SPI_MEM_BUS_FIFO0_UDF_INT interrupt. 1: Triggered when BUS0 FIFO is
         *  underflow.
         */
        uint32_t bus_fifo0_udf_int_raw:1;
    };
    uint32_t val;
} spi_mem_c_int_raw_reg_t;

/** Type of int_st register
 *  SPI0 interrupt status register
 */
typedef union {
    struct {
        uint32_t reserved_0:3;
        /** slv_st_end_int_st : RO; bitpos: [3]; default: 0;
         *  The status bit for SPI_MEM_SLV_ST_END_INT interrupt.
         */
        uint32_t slv_st_end_int_st:1;
        /** mst_st_end_int_st : RO; bitpos: [4]; default: 0;
         *  The status bit for SPI_MEM_MST_ST_END_INT interrupt.
         */
        uint32_t mst_st_end_int_st:1;
        /** ecc_err_int_st : RO; bitpos: [5]; default: 0;
         *  The status bit for SPI_MEM_ECC_ERR_INT interrupt.
         */
        uint32_t ecc_err_int_st:1;
        /** pms_reject_int_st : RO; bitpos: [6]; default: 0;
         *  The status bit for SPI_MEM_PMS_REJECT_INT interrupt.
         */
        uint32_t pms_reject_int_st:1;
        /** axi_raddr_err_int_st : RO; bitpos: [7]; default: 0;
         *  The enable bit for SPI_MEM_AXI_RADDR_ERR_INT interrupt.
         */
        uint32_t axi_raddr_err_int_st:1;
        /** axi_wr_flash_err_int_st : RO; bitpos: [8]; default: 0;
         *  The enable bit for SPI_MEM_AXI_WR_FALSH_ERR_INT interrupt.
         */
        uint32_t axi_wr_flash_err_int_st:1;
        /** axi_waddr_err_int_st : RO; bitpos: [9]; default: 0;
         *  The enable bit for SPI_MEM_AXI_WADDR_ERR_INT interrupt.
         */
        uint32_t axi_waddr_err_int_st:1;
        uint32_t reserved_10:18;
        /** dqs0_afifo_ovf_int_st : RO; bitpos: [28]; default: 0;
         *  The status bit for SPI_MEM_DQS0_AFIFO_OVF_INT interrupt.
         */
        uint32_t dqs0_afifo_ovf_int_st:1;
        /** dqs1_afifo_ovf_int_st : RO; bitpos: [29]; default: 0;
         *  The status bit for SPI_MEM_DQS1_AFIFO_OVF_INT interrupt.
         */
        uint32_t dqs1_afifo_ovf_int_st:1;
        /** bus_fifo1_udf_int_st : RO; bitpos: [30]; default: 0;
         *  The status bit for SPI_MEM_BUS_FIFO1_UDF_INT interrupt.
         */
        uint32_t bus_fifo1_udf_int_st:1;
        /** bus_fifo0_udf_int_st : RO; bitpos: [31]; default: 0;
         *  The status bit for SPI_MEM_BUS_FIFO0_UDF_INT interrupt.
         */
        uint32_t bus_fifo0_udf_int_st:1;
    };
    uint32_t val;
} spi_mem_c_int_st_reg_t;


