espressif/esp-idf/components/soc/esp32h4/register/soc/spi_mem_c_struct.h
/** Type of smem_din_hex_num register
 *  MSPI 16x external RAM input timing delay number control register
 */
typedef union {
    struct {
        /** smem_din08_num : HRO; bitpos: [1:0]; default: 0;
         *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
         *  delayed by 2 cycles,...
         */
        uint32_t smem_din08_num:2;
        /** smem_din09_num : HRO; bitpos: [3:2]; default: 0;
         *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
         *  delayed by 2 cycles,...
         */
        uint32_t smem_din09_num:2;
        /** smem_din10_num : HRO; bitpos: [5:4]; default: 0;
         *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
         *  delayed by 2 cycles,...
         */
        uint32_t smem_din10_num:2;
        /** smem_din11_num : HRO; bitpos: [7:6]; default: 0;
         *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
         *  delayed by 2 cycles,...
         */
        uint32_t smem_din11_num:2;
        /** smem_din12_num : HRO; bitpos: [9:8]; default: 0;
         *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
         *  delayed by 2 cycles,...
         */
        uint32_t smem_din12_num:2;
        /** smem_din13_num : HRO; bitpos: [11:10]; default: 0;
         *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
         *  delayed by 2 cycles,...
         */
        uint32_t smem_din13_num:2;
        /** smem_din14_num : HRO; bitpos: [13:12]; default: 0;
         *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
         *  delayed by 2 cycles,...
         */
        uint32_t smem_din14_num:2;
        /** smem_din15_num : HRO; bitpos: [15:14]; default: 0;
         *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
         *  delayed by 2 cycles,...
         */
        uint32_t smem_din15_num:2;
        /** smem_dins_hex_num : HRO; bitpos: [17:16]; default: 0;
         *  the input signals are delayed by system clock cycles, 0: delayed by 1 cycle, 1:
         *  delayed by 2 cycles,...
         */
        uint32_t smem_dins_hex_num:2;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} spi_smem_din_hex_num_reg_t;

/** Type of smem_dout_hex_mode register
 *  MSPI 16x external RAM output timing adjustment control register
 */
typedef union {
    struct {
        /** smem_dout08_mode : HRO; bitpos: [0]; default: 0;
         *  the output signals are delayed by system clock cycles, 0: output without delayed,
         *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
         *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
         *  with the spi_clk high edge ,6: output with the spi_clk low edge
         */
        uint32_t smem_dout08_mode:1;
        /** smem_dout09_mode : HRO; bitpos: [1]; default: 0;
         *  the output signals are delayed by system clock cycles, 0: output without delayed,
         *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
         *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
         *  with the spi_clk high edge ,6: output with the spi_clk low edge
         */
        uint32_t smem_dout09_mode:1;
        /** smem_dout10_mode : HRO; bitpos: [2]; default: 0;
         *  the output signals are delayed by system clock cycles, 0: output without delayed,
         *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
         *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
         *  with the spi_clk high edge ,6: output with the spi_clk low edge
         */
        uint32_t smem_dout10_mode:1;
        /** smem_dout11_mode : HRO; bitpos: [3]; default: 0;
         *  the output signals are delayed by system clock cycles, 0: output without delayed,
         *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
         *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
         *  with the spi_clk high edge ,6: output with the spi_clk low edge
         */
        uint32_t smem_dout11_mode:1;
        /** smem_dout12_mode : HRO; bitpos: [4]; default: 0;
         *  the output signals are delayed by system clock cycles, 0: output without delayed,
         *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
         *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
         *  with the spi_clk high edge ,6: output with the spi_clk low edge
         */
        uint32_t smem_dout12_mode:1;
        /** smem_dout13_mode : HRO; bitpos: [5]; default: 0;
         *  the output signals are delayed by system clock cycles, 0: output without delayed,
         *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
         *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
         *  with the spi_clk high edge ,6: output with the spi_clk low edge
         */
        uint32_t smem_dout13_mode:1;
        /** smem_dout14_mode : HRO; bitpos: [6]; default: 0;
         *  the output signals are delayed by system clock cycles, 0: output without delayed,
         *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
         *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
         *  with the spi_clk high edge ,6: output with the spi_clk low edge
         */
        uint32_t smem_dout14_mode:1;
        /** smem_dout15_mode : HRO; bitpos: [7]; default: 0;
         *  the output signals are delayed by system clock cycles, 0: output without delayed,
         *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
         *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
         *  with the spi_clk high edge ,6: output with the spi_clk low edge
         */
        uint32_t smem_dout15_mode:1;
        /** smem_douts_hex_mode : HRO; bitpos: [8]; default: 0;
         *  the output signals are delayed by system clock cycles, 0: output without delayed,
         *  1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
         *  output with the posedge of clk_160,4 output with the negedge of clk_160,5: output
         *  with the spi_clk high edge ,6: output with the spi_clk low edge
         */
        uint32_t smem_douts_hex_mode:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} spi_smem_dout_hex_mode_reg_t;


/** Group: NAND FLASH control and status registers */
/** Type of nand_flash_en register
 *  NAND FLASH control register
 */
typedef union {
    struct {
        /** nand_flash_en : HRO; bitpos: [0]; default: 0;
         *  NAND FLASH function enable signal. 1: Enable NAND FLASH, Disable NOR FLASH. 0:
         *  Disable NAND FLASH, Enable NOR FLASH.
         */
        uint32_t nand_flash_en:1;
        /** nand_flash_seq_hd_index : HRO; bitpos: [15:1]; default: 32767;
         *  NAND FLASH spi seq head index configure register. Every 5 bits represent  the 1st
         *  index of a SPI CMD sequence.[14:10]:usr; [9:5]:axi_rd; [4:0]:axi_wr.
         */
        uint32_t nand_flash_seq_hd_index:15;
        /** nand_flash_seq_usr_trig : HRO; bitpos: [16]; default: 0;
         *  NAND FLASH spi seq user trigger configure register. SPI_MEM_NAND_FLASH_SEQ_USR_TRIG
         *  is corresponds to SPI_MEM_NAND_FLASH_SEQ_HD_INDEX[14:10].1: enable 0: disable.
         */
        uint32_t nand_flash_seq_usr_trig:1;
        /** nand_flash_lut_en : HRO; bitpos: [17]; default: 0;
         *  NAND FLASH spi seq & cmd lut cfg en. 1: enable 0: disable.
         */
        uint32_t nand_flash_lut_en:1;
        /** nand_flash_seq_usr_wend : HRO; bitpos: [18]; default: 0;
         *  Used with SPI_MEM_NAND_FLASH_SEQ_USR_TRIG to indicate the last page program ,and to
         *  execute page execute. 1: write end 0: write in a page size.
         */
        uint32_t nand_flash_seq_usr_wend:1;
        uint32_t reserved_19:13;
    };
    uint32_t val;
} spi_mem_c_nand_flash_en_reg_t;

/** Type of nand_flash_sr_addr0 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** nand_flash_sr_addr0 : HRO; bitpos: [7:0]; default: 0;
         *  configure state register address for SPI SEQ need. If OIP is in address C0H , user
         *  could configure C0H into this register
         */
        uint32_t nand_flash_sr_addr0:8;
        /** nand_flash_sr_addr1 : HRO; bitpos: [15:8]; default: 0;
         *  configure state register address for SPI SEQ need. If OIP is in address C0H , user
         *  could configure C0H into this register
         */
        uint32_t nand_flash_sr_addr1:8;
        /** nand_flash_sr_addr2 : HRO; bitpos: [23:16]; default: 0;
         *  configure state register address for SPI SEQ need. If OIP is in address C0H , user
         *  could configure C0H into this register
         */
        uint32_t nand_flash_sr_addr2:8;
        /** nand_flash_sr_addr3 : HRO; bitpos: [31:24]; default: 0;
         *  configure state register address for SPI SEQ need. If OIP is in address C0H , user
         *  could configure C0H into this register
         */
        uint32_t nand_flash_sr_addr3:8;
    };
    uint32_t val;
} spi_mem_c_nand_flash_sr_addr0_reg_t;

/** Type of nand_flash_sr_din0 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** nand_flash_sr_din0 : RO; bitpos: [7:0]; default: 0;
         *  spi read state register data to this register for SPI SEQ need.
         *  SPI_MEM_NAND_FLASH_SR_DIN0_REG corresponds to SPI_MEM_NAND_FLASH_SR_ADDR0_REG.
         */
        uint32_t nand_flash_sr_din0:8;
        /** nand_flash_sr_din1 : RO; bitpos: [15:8]; default: 0;
         *  spi read state register data to this register for SPI SEQ need.
         *  SPI_MEM_NAND_FLASH_SR_DIN0_REG corresponds to SPI_MEM_NAND_FLASH_SR_ADDR0_REG.
         */
        uint32_t nand_flash_sr_din1:8;
        /** nand_flash_sr_din2 : RO; bitpos: [23:16]; default: 0;
         *  spi read state register data to this register for SPI SEQ need.
         *  SPI_MEM_NAND_FLASH_SR_DIN0_REG corresponds to SPI_MEM_NAND_FLASH_SR_ADDR0_REG.
         */
        uint32_t nand_flash_sr_din2:8;
        /** nand_flash_sr_din3 : RO; bitpos: [31:24]; default: 0;
         *  spi read state register data to this register for SPI SEQ need.
         *  SPI_MEM_NAND_FLASH_SR_DIN0_REG corresponds to SPI_MEM_NAND_FLASH_SR_ADDR0_REG.
         */
        uint32_t nand_flash_sr_din3:8;
    };
    uint32_t val;
} spi_mem_c_nand_flash_sr_din0_reg_t;

/** Type of nand_flash_cfg_data0 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** nand_flash_cfg_data0 : HRO; bitpos: [15:0]; default: 0;
         *  configure data for SPI SEQ din/dout need. The data could be use to configure NAND
         *  FLASH or compare read data
         */
        uint32_t nand_flash_cfg_data0:16;
        /** nand_flash_cfg_data1 : HRO; bitpos: [31:16]; default: 0;
         *  configure data for SPI SEQ din/dout need. The data could be use to configure NAND
         *  FLASH or compare read data
         */
        uint32_t nand_flash_cfg_data1:16;
    };
    uint32_t val;
} spi_mem_c_nand_flash_cfg_data0_reg_t;

/** Type of nand_flash_cfg_data1 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** nand_flash_cfg_data2 : HRO; bitpos: [15:0]; default: 0;
         *  configure data for SPI SEQ din/dout need. The data could be use to configure NAND
         *  FLASH or compare read data
         */
        uint32_t nand_flash_cfg_data2:16;
        /** nand_flash_cfg_data3 : HRO; bitpos: [31:16]; default: 0;
         *  configure data for SPI SEQ din/dout need. The data could be use to configure NAND
         *  FLASH or compare read data
         */
        uint32_t nand_flash_cfg_data3:16;
    };
    uint32_t val;
} spi_mem_c_nand_flash_cfg_data1_reg_t;

/** Type of nand_flash_cfg_data2 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** nand_flash_cfg_data4 : HRO; bitpos: [15:0]; default: 0;
         *  configure data for SPI SEQ din/dout need. The data could be use to configure NAND
         *  FLASH or compare read data
         */
        uint32_t nand_flash_cfg_data4:16;
        /** nand_flash_cfg_data5 : HRO; bitpos: [31:16]; default: 0;
         *  configure data for SPI SEQ din/dout need. The data could be use to configure NAND
         *  FLASH or compare read data
         */
        uint32_t nand_flash_cfg_data5:16;
    };
    uint32_t val;
} spi_mem_c_nand_flash_cfg_data2_reg_t;

/** Type of nand_flash_cmd_lut0 register
 *  MSPI NAND FLASH CMD LUT control register
 */
typedef union {
    struct {
        /** nand_flash_lut_cmd_value0 : HRO; bitpos: [15:0]; default: 0;
         *  MSPI NAND FLASH config cmd value at cmd lut address 0.
         */
        uint32_t nand_flash_lut_cmd_value0:16;
        /** nand_flash_lut_sfsm_st_en0 : HRO; bitpos: [19:16]; default: 0;
         *  MSPI NAND FLASH config sfsm_st_en at cmd lut address 0.[3]-ADDR period enable;
         *  [2]-DUMMY period enable; [1]-DIN period; [0]-DOUT period.
         */
        uint32_t nand_flash_lut_sfsm_st_en0:4;
        /** nand_flash_lut_cmd_len0 : HRO; bitpos: [23:20]; default: 0;
         *  MSPI NAND FLASH config cmd length at cmd lut address 0.
         */
        uint32_t nand_flash_lut_cmd_len0:4;
        /** nand_flash_lut_addr_len0 : HRO; bitpos: [27:24]; default: 0;
         *  MSPI NAND FLASH config address length at cmd lut address 0.
         */
        uint32_t nand_flash_lut_addr_len0:4;
        /** nand_flash_lut_data_len0 : HRO; bitpos: [29:28]; default: 0;
         *  MSPI NAND FLASH config data length at cmd lut address 0.
         */
        uint32_t nand_flash_lut_data_len0:2;
        /** nand_flash_lut_bus_en0 : HRO; bitpos: [30]; default: 0;
         *  MSPI NAND FLASH config spi_bus_en at cmd lut address 0,SPI could use DUAL/QUAD mode
         *  while enable, SPI could use SINGLE mode while disable.1:Enable. 0:Disable.(Note
         *  these registers are described to indicate the SPI_MEM_NAND_FLASH_CMD_LUT0_REG's
         *  field. The number of CMD LUT entries can be defined by the user, but cannot exceed
         *  16 )
         */
        uint32_t nand_flash_lut_bus_en0:1;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} spi_mem_c_nand_flash_cmd_lut0_reg_t;

/** Type of nand_flash_spi_seq0 register
 *  NAND FLASH SPI SEQ control register
 */
typedef union {
    struct {
        /** nand_flash_seq_tail_flg0 : HRO; bitpos: [0]; default: 0;
         *  MSPI NAND FLASH config seq_tail_flg at spi seq index 0.1: The last index for
         *  sequence. 0: Not the last index.
         */
        uint32_t nand_flash_seq_tail_flg0:1;
        /** nand_flash_sr_chk_en0 : HRO; bitpos: [1]; default: 0;
         *  MSPI NAND FLASH config sr_chk_en at spi seq index 0. 1: enable 0: disable.
         */
        uint32_t nand_flash_sr_chk_en0:1;
        /** nand_flash_din_index0 : HRO; bitpos: [5:2]; default: 0;
         *  MSPI NAND FLASH config din_index at spi seq index 0.  Use with
         *  SPI_MEM_NAND_FLASH_CFG_DATA
         */
        uint32_t nand_flash_din_index0:4;
        /** nand_flash_addr_index0 : HRO; bitpos: [9:6]; default: 0;
         *  MSPI NAND FLASH config addr_index at spi seq index 0.  Use with
         *  SPI_MEM_NAND_FLASH_SR_ADDR
         */
        uint32_t nand_flash_addr_index0:4;
        /** nand_flash_req_or_cfg0 : HRO; bitpos: [10]; default: 0;
         *  MSPI NAND FLASH config reg_or_cfg at spi seq index 0. 1: AXI/APB request  0: SPI
         *  SEQ configuration.
         */
        uint32_t nand_flash_req_or_cfg0:1;
        /** nand_flash_cmd_index0 : HRO; bitpos: [14:11]; default: 0;
         *  MSPI NAND FLASH config spi_cmd_index at spi seq index 0. Use to find SPI command in
         *  CMD LUT.(Note these registers are described to indicate the
         *  SPI_MEM_NAND_FLASH_SPI_SEQ_REG' fieldd The number of CMD LUT entries can be defined
         *  by the user, but cannot exceed 16 )
         */
        uint32_t nand_flash_cmd_index0:4;
        uint32_t reserved_15:17;
    };
    uint32_t val;
} spi_mem_c_nand_flash_spi_seq0_reg_t;


/** Group: Manual Encryption plaintext Memory */
/** Type of xts_plain_base register
 *  The base address of the memory that stores plaintext in Manual Encryption
 */
typedef union {
    struct {
        /** xts_plain : R/W; bitpos: [31:0]; default: 0;
         *  This field is only used to generate include file in c case. This field is useless.
         *  Please do not use this field.
         */
        uint32_t xts_plain:32;
    };
    uint32_t val;
} spi_mem_c_xts_plain_base_reg_t;


/** Group: Manual Encryption configuration registers */
/** Type of xts_linesize register
 *  Manual Encryption Line-Size register
 */
typedef union {
    struct {
        /** xts_linesize : R/W; bitpos: [1:0]; default: 0;
         *  This bits stores the line-size parameter which will be used in manual encryption
         *  calculation. It decides how many bytes will be encrypted one time. 0: 16-bytes, 1:
         *  32-bytes, 2: 64-bytes, 3:reserved.
         */
        uint32_t xts_linesize:2;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} spi_mem_c_xts_linesize_reg_t;

/** Type of xts_destination register
 *  Manual Encryption destination register
 */
typedef union {
    struct {
        /** xts_destination : R/W; bitpos: [0]; default: 0;
         *  This bit stores the destination parameter which will be used in manual encryption
         *  calculation. 0: flash(default), 1: psram(reserved). Only default value can be used.
         */
        uint32_t xts_destination:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} spi_mem_c_xts_destination_reg_t;

/** Type of xts_physical_address register
 *  Manual Encryption physical address register
 */
typedef union {
    struct {
        /** xts_physical_address : R/W; bitpos: [29:0]; default: 0;
         *  This bits stores the physical-address parameter which will be used in manual
         *  encryption calculation. This value should aligned with byte number decided by
         *  line-size parameter.
         */
        uint32_t xts_physical_address:30;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} spi_mem_c_xts_physical_address_reg_t;


/** Group: Manual Encryption control and status registers */
/** Type of xts_trigger register
 *  Manual Encryption physical address register
 */
typedef union {
    struct {
        /** xts_trigger : WT; bitpos: [0]; default: 0;
         *  Set this bit to trigger the process of manual encryption calculation. This action
         *  should only be asserted when manual encryption status is 0. After this action,
         *  manual encryption status becomes 1. After calculation is done, manual encryption
         *  status becomes 2.
         */
        uint32_t xts_trigger:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} spi_mem_c_xts_trigger_reg_t;

/** Type of xts_release register
 *  Manual Encryption physical address register
 */
typedef union {
    struct {
        /** xts_release : WT; bitpos: [0]; default: 0;
         *  Set this bit to release encrypted result to mspi. This action should only be
         *  asserted when manual encryption status is 2. After this action, manual encryption
         *  status will become 3.
         */
        uint32_t xts_release:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} spi_mem_c_xts_release_reg_t;

/** Type of xts_destroy register
 *  Manual Encryption physical address register
 */
typedef union {
    struct {
        /** xts_destroy : WT; bitpos: [0]; default: 0;
         *  Set this bit to destroy encrypted result. This action should be asserted only when
         *  manual encryption status is 3. After this action, manual encryption status will
         *  become 0.
         */
        uint32_t xts_destroy:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} spi_mem_c_xts_destroy_reg_t;

/** Type of xts_state register
 *  Manual Encryption physical address register
 */
typedef union {
    struct {
        /** xts_state : RO; bitpos: [1:0]; default: 0;
         *  This bits stores the status of manual encryption. 0: idle, 1: busy of encryption
         *  calculation, 2: encryption calculation is done but the encrypted result is
         *  invisible to mspi, 3: the encrypted result is visible to mspi.
         */
        uint32_t xts_state:2;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} spi_mem_c_xts_state_reg_t;


/** Group: Manual Encryption version control register */
/** Type of xts_date register
 *  Manual Encryption version register
 */
typedef union {
    struct {
        /** xts_date : R/W; bitpos: [29:0]; default: 539035911;
         *  This bits stores the last modified-time of manual encryption feature.
         */
        uint32_t xts_date:30;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} spi_mem_c_xts_date_reg_t;


/** Group: MMU access registers */
/** Type of mmu_item_content register
 *  MSPI-MMU item content register
 */
typedef union {
    struct {
        /** mmu_item_content : R/W; bitpos: [31:0]; default: 892;
         *  MSPI-MMU item content
         */
        uint32_t mmu_item_content:32;
    };
    uint32_t val;
} spi_mem_c_mmu_item_content_reg_t;

