espressif/esp-idf/components/soc/esp32h4/register/soc/spi_mem_c_struct.h
/** Type of mmu_item_index register
 *  MSPI-MMU item index register
 */
typedef union {
    struct {
        /** mmu_item_index : R/W; bitpos: [31:0]; default: 0;
         *  MSPI-MMU item index
         */
        uint32_t mmu_item_index:32;
    };
    uint32_t val;
} spi_mem_c_mmu_item_index_reg_t;


/** Group: MMU power control and configuration registers */
/** Type of mmu_power_ctrl register
 *  MSPI MMU power control register
 */
typedef union {
    struct {
        /** mmu_force_on : R/W; bitpos: [0]; default: 0;
         *  Set this bit to enable mmu-memory clock force on
         */
        uint32_t mmu_force_on:1;
        uint32_t reserved_1:2;
        /** mmu_page_size : R/W; bitpos: [4:3]; default: 0;
         *  0: Max page size , 1: Max page size/2 , 2: Max page size/4, 3: Max page size/8
         */
        uint32_t mmu_page_size:2;
        uint32_t reserved_5:11;
        /** aux_ctrl : R/W; bitpos: [29:16]; default: 4896;
         *  MMU PSRAM aux control register
         */
        uint32_t aux_ctrl:14;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} spi_mem_c_mmu_power_ctrl_reg_t;


/** Group: External mem cryption DPA registers */
/** Type of dpa_ctrl register
 *  SPI memory cryption DPA register
 */
typedef union {
    struct {
        /** crypt_security_level : R/W; bitpos: [2:0]; default: 7;
         *  Set the security level of spi mem cryption. 0: Shut off cryption DPA function. 1-7:
         *  The bigger the number is, the more secure the cryption is. (Note that the
         *  performance of cryption will decrease together with this number increasing)
         */
        uint32_t crypt_security_level:3;
        /** crypt_calc_d_dpa_en : R/W; bitpos: [3]; default: 1;
         *  Only available when SPI_CRYPT_SECURITY_LEVEL is not 0. 1: Enable DPA in the
         *  calculation that using key 1 or key 2. 0: Enable DPA only in the calculation that
         *  using key 1.
         */
        uint32_t crypt_calc_d_dpa_en:1;
        /** crypt_dpa_select_register : R/W; bitpos: [4]; default: 0;
         *  1: MSPI XTS DPA clock gate is controlled by SPI_CRYPT_CALC_D_DPA_EN and
         *  SPI_CRYPT_SECURITY_LEVEL. 0: Controlled by efuse bits.
         */
        uint32_t crypt_dpa_select_register:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} spi_mem_c_dpa_ctrl_reg_t;


/** Group: External mem cryption PSEUDO registers */
/** Type of xts_pseudo_round_conf register
 *  SPI memory cryption PSEUDO register
 */
typedef union {
    struct {
        /** mode_pseudo : R/W; bitpos: [1:0]; default: 0;
         *  Set the mode of pseudo. 2'b00: crypto without pseudo. 2'b01: state T with pseudo
         *  and state D without pseudo. 2'b10: state T with pseudo and state D with few pseudo.
         *  2'b11: crypto with pseudo.
         */
        uint32_t mode_pseudo:2;
        /** pseudo_rng_cnt : R/W; bitpos: [4:2]; default: 7;
         *  xts aes peseudo function base round that must be performed.
         */
        uint32_t pseudo_rng_cnt:3;
        /** pseudo_base : R/W; bitpos: [8:5]; default: 2;
         *  xts aes peseudo function base round that must be performed.
         */
        uint32_t pseudo_base:4;
        /** pseudo_inc : R/W; bitpos: [10:9]; default: 2;
         *  xts aes peseudo function increment round that will be performed randomly between 0 &
         *  2**(inc+1).
         */
        uint32_t pseudo_inc:2;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} spi_mem_c_xts_pseudo_round_conf_reg_t;


/** Group: Version control register */
/** Type of date register
 *  SPI0 version control register
 */
typedef union {
    struct {
        /** date : R/W; bitpos: [27:0]; default: 37822512;
         *  SPI0 register version.
         */
        uint32_t date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} spi_mem_c_date_reg_t;


typedef struct {
    volatile spi_mem_c_cmd_reg_t cmd;
    uint32_t reserved_004;
    volatile spi_mem_c_ctrl_reg_t ctrl;
    volatile spi_mem_c_ctrl1_reg_t ctrl1;
    volatile spi_mem_c_ctrl2_reg_t ctrl2;
    volatile spi_mem_c_clock_reg_t clock;
    volatile spi_mem_c_user_reg_t user;
    volatile spi_mem_c_user1_reg_t user1;
    volatile spi_mem_c_user2_reg_t user2;
    uint32_t reserved_024[4];
    volatile spi_mem_c_misc_reg_t misc;
    uint32_t reserved_038;
    volatile spi_mem_c_cache_fctrl_reg_t cache_fctrl;
    volatile spi_mem_c_cache_sctrl_reg_t mem_cache_sctrl;
    volatile spi_mem_c_sram_cmd_reg_t sram_cmd;
    volatile spi_mem_c_sram_drd_cmd_reg_t mem_sram_drd_cmd;
    volatile spi_mem_c_sram_dwr_cmd_reg_t mem_sram_dwr_cmd;
    volatile spi_mem_c_sram_clk_reg_t mem_sram_clk;
    volatile spi_mem_c_fsm_reg_t fsm;
    uint32_t reserved_058[26];
    volatile spi_mem_c_int_ena_reg_t int_ena;
    volatile spi_mem_c_int_clr_reg_t int_clr;
    volatile spi_mem_c_int_raw_reg_t int_raw;
    volatile spi_mem_c_int_st_reg_t int_st;
    uint32_t reserved_0d0;
    volatile spi_mem_c_ddr_reg_t ddr;
    volatile spi_smem_ddr_reg_t smem_ddr;
    uint32_t reserved_0dc[9];
    volatile spi_fmem_pmsn_attr_reg_t fmem_pmsn_attr[4];
    volatile spi_fmem_pmsn_addr_reg_t fmem_pmsn_addr[4];
    volatile spi_fmem_pmsn_size_reg_t fmem_pmsn_size[4];
    volatile spi_smem_pmsn_attr_reg_t smem_pmsn_attr[4];
    volatile spi_smem_pmsn_addr_reg_t smem_pmsn_addr[4];
    volatile spi_smem_pmsn_size_reg_t smem_pmsn_size[4];
    volatile spi_mem_c_pms_reject_reg_t pms_reject;
    volatile spi_mem_c_pms_reject_addr_reg_t pms_reject_addr;
    volatile spi_mem_c_ecc_ctrl_reg_t ecc_ctrl;
    volatile spi_mem_c_ecc_err_addr_reg_t ecc_err_addr;
    volatile spi_mem_c_axi_err_addr_reg_t axi_err_addr;
    volatile spi_smem_ecc_ctrl_reg_t smem_ecc_ctrl;
    volatile spi_smem_axi_addr_ctrl_reg_t smem_axi_addr_ctrl;
    volatile spi_mem_c_axi_err_resp_en_reg_t axi_err_resp_en;
    volatile spi_mem_c_timing_cali_reg_t timing_cali;
    volatile spi_mem_c_din_mode_reg_t din_mode;
    volatile spi_mem_c_din_num_reg_t din_num;
    volatile spi_mem_c_dout_mode_reg_t dout_mode;
    volatile spi_smem_timing_cali_reg_t smem_timing_cali;
    volatile spi_smem_din_mode_reg_t smem_din_mode;
    volatile spi_smem_din_num_reg_t smem_din_num;
    volatile spi_smem_dout_mode_reg_t smem_dout_mode;
    volatile spi_smem_ac_reg_t smem_ac;
    volatile spi_smem_din_hex_mode_reg_t smem_din_hex_mode;
    volatile spi_smem_din_hex_num_reg_t smem_din_hex_num;
    volatile spi_smem_dout_hex_mode_reg_t smem_dout_hex_mode;
    uint32_t reserved_1b0[20];
    volatile spi_mem_c_clock_gate_reg_t clock_gate;
    volatile spi_mem_c_nand_flash_en_reg_t nand_flash_en;
    volatile spi_mem_c_nand_flash_sr_addr0_reg_t nand_flash_sr_addr0;
    volatile spi_mem_c_nand_flash_sr_din0_reg_t nand_flash_sr_din0;
    volatile spi_mem_c_nand_flash_cfg_data0_reg_t nand_flash_cfg_data0;
    volatile spi_mem_c_nand_flash_cfg_data1_reg_t nand_flash_cfg_data1;
    volatile spi_mem_c_nand_flash_cfg_data2_reg_t nand_flash_cfg_data2;
    uint32_t reserved_21c[9];
    volatile spi_mem_c_nand_flash_cmd_lut0_reg_t nand_flash_cmd_lut0;
    uint32_t reserved_244[15];
    volatile spi_mem_c_nand_flash_spi_seq0_reg_t nand_flash_spi_seq0;
    uint32_t reserved_284[31];
    volatile spi_mem_c_xts_plain_base_reg_t xts_plain_base;
    uint32_t reserved_304[15];
    volatile spi_mem_c_xts_linesize_reg_t xts_linesize;
    volatile spi_mem_c_xts_destination_reg_t xts_destination;
    volatile spi_mem_c_xts_physical_address_reg_t xts_physical_address;
    volatile spi_mem_c_xts_trigger_reg_t xts_trigger;
    volatile spi_mem_c_xts_release_reg_t xts_release;
    volatile spi_mem_c_xts_destroy_reg_t xts_destroy;
    volatile spi_mem_c_xts_state_reg_t xts_state;
    volatile spi_mem_c_xts_date_reg_t xts_date;
    uint32_t reserved_360[7];
    volatile spi_mem_c_mmu_item_content_reg_t mmu_item_content;
    volatile spi_mem_c_mmu_item_index_reg_t mmu_item_index;
    volatile spi_mem_c_mmu_power_ctrl_reg_t mmu_power_ctrl;
    volatile spi_mem_c_dpa_ctrl_reg_t dpa_ctrl;
    volatile spi_mem_c_xts_pseudo_round_conf_reg_t xts_pseudo_round_conf;
    uint32_t reserved_390[27];
    volatile spi_mem_c_date_reg_t date;
} spi_mem_c_dev_t;


#ifndef __cplusplus
_Static_assert(sizeof(spi_mem_c_dev_t) == 0x400, "Invalid size of spi_mem_c_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
